{
    "program_items": [
        {
            "program_start" : "true"
        },
        
        {
            "day_header" : "true",
            "day" : "monday",
            "day_title" : "Monday, August 10, 2020 EDT"
        },
        
        {
            "keynote" : "true",
            "time" : "10:00 - 10:10 am EDT",
            "keynote_title" : "Workshop opening",
            "day" : "monday"
        },
                
        {
            "session_header" : "true",
            "time" : "10:10 - 11:50 am EDT",
            "title": "Session 1: Invited Talks",
            "day" : "monday"
        },

        {
            "paper" : "true",
            "day" : "monday",
            "title" : "How to BOLD-ly Support Data-Intensive Applications? (25min)",
            "authors" : "Eugene Ng <em>(Rice University)</em>",
            "abstract" : "Data-intensive applications are on the rise in large-scale compute clusters and they constantly transmit large objects across servers. How these applications are supported today could be characterized as 'leave it to the network' or 'leave it to the application.' In this talk, we will explore a different approach that achieves the best of both worlds, by combining packet switch bandwidth from the network edge with an optical network architecture to provide a scalable, predictable, and reliable alternative"
        },

        
        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Optical datacenter networks: towards practical deployment (25min)",
            "authors" : "Giannis Patronas <em>(Nvidia Networking, Mellanox Advanced Technologies)</em>",
            "abstract" : "Scaling up the datacenter (DC) network results in higher switch energy consumption due to the breakdown of Dennard scaling. Signs of Moore’s law erosion question the capability to cope with exponentially growing intra-DC traffic in the long run. The introduction of optical switching could simultaneously address the bandwidth and energy consumption challenges in the DC interconnection network. However, the lack of key functionalities in the optical domain (i.e. buffering and header processing) hinders the introduction of such optical circuit switches in the DC. Novel approaches are required for the design of the optical DC network as well as for the associated devices connected in the optical DC (e.g. NICs, switches, transceivers). This presentation will outline the main challenges we are facing and will provide a short description of our activities towards the practical deployment of optical switches in the DC network. "
        },

        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Optics for the cloud – Light at the end of the tunnel? (25min)",
            "authors" : "Thomas Karagiannis <em>(Microsoft)</em>",
            "abstract" : "The amazing growth of the cloud has also led to the emergence of inflection points that may hinder future cloud scaling. In this talk, I will discuss how the optics for the cloud team at Microsoft Research Cambridge is betting on optical technologies and cross-layer innovation across the cloud stack to alleviate challenges leading to these inflection points. "
        },

        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Nanoseconds Optical Control and Switching System for Data Center Networks (25min)",
            "abstract" : "As the traffic in DC networks steady growth, the electrical switching based data center networks (DCNs) have intrinsic bandwidth bottleneck and require power consuming multi-tier switching layers. Optical nanoseconds switched DCN systems could provide very large bandwidth and high-efficient cost and power performance. However, the deployment of nanoseconds optical switches in DCNs remains a challenge due to the lack of nanoseconds switch control, optical buffers for packet contention resolution, and the need of high-cost burst clock and data recovery. In this work we present a nanosecond switch control and clock-distribution technique that is experimentally demonstrated and deployed to enable a nanoseconds optical switched DCN with packet contention resolution and no burst mode receiver. Results confirm that the nanoseconds switch control and clock-distribution technique provide few tens of otical switching reconfiguration time, data and clock recovery within a few ns with stable operation and low packet loss.",
            "authors" : "Nicola Calabretta <em>(Eindhoven University of Technology)</em>"
        },

        {
            "break" : "true",
            "time" : "12.00 - 12.10 pm EDT",
            "break_type" : "(Virtual) Coffee Break",
            "day" : "monday"
        },

        {
            "session_header" : "true",
            "time" : "12:10 - 2:00 pm EDT",
            "title": "Session 2: Accepted Presentations",
            "day" : "monday"
        },
        
        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Optical Fibre as a Sensor for Network Anomaly Detection (15min)",
            "authors" : "Aamir Gulistan <em>(Simula Research Laboratory)</em>, Steinar Bjørnstad <em>(Simula Research Laboratory)</em>"
        },
 
        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Leveraging Optical Noise for Fast Fiber Cut Recovery (15min)",
            "authors" : "Zhizhen Zhong <em>(Facebook)</em>, Yiting Xia <em>(Facebook)</em>, Ying Zhang <em>(Facebook)</em>, Jonathan Leach <em>(Facebook)</em>, Manya Ghobadi <em>(MIT)</em>"
        },
 
        {
            "paper" : "true",
            "day" : "monday",
            "title" : "The Impact of Social Distancing on Facebook's Optical Backbone (15min)",
            "authors" : "Zhizhen Zhong <em>(Facebook)</em>, Yiting Xia <em>(Facebook)</em>, Guanqing Yan <em>(Facebook)</em>, Chiun Lin Lim <em>(Facebook)</em>, Ying Zhang <em>(Facebook)</em>, Kimia Ghobadi <em>(Johns Hopkins University)</em>, Manya Ghobadi <em>(MIT)</em>"
        },
 
        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Topology Augmentation Meets Machine Learning (15min)",
            "authors" : "Saim Salman <em>(Brown University)</em>, Theophilus Benson <em>(Brown University)</em>"
        },
 
        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Analyzing the Robustness of the Chilean Optical Network (15min)",
            "authors" : "Ivana Bachmann <em>(NIC Chile Research Labs, Universidad de Chile)</em>, Javier Bustos-Jiménez <em>(NIC Chile Research Labs, Universidad de Chile)</em>, Jose Piquer <em>(DSTI, Universidad de Chile)</em>, Cecilia Saint-Pierre <em>(DSTI, Universidad de Chile)</em>, Matilde Rivas <em>(NIC Chile Research Labs, Universidad de Chile)</em>, Marcelo Valenzuela <em>(NIC Chile Research Labs, Universidad de Chile)</em>"
        },
 
        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Bridging the Optical-Packet Network Chasm via Secure Enclaves (15min)",
            "authors" : "Matthew Nance Hall <em>(University of Oregon)</em>, Ramakrishnan Durairajan <em>(University of Oregon)</em>"
        },

        {
            "break" : "true",
            "time" : "2.00 - 2.05 pm EDT",
            "break_type" : "(Virtual) Coffee Break",
            "day" : "monday"
        },

        {
            "session_header" : "true",
            "time" : "2:05 - 3:55 pm EDT",
            "title": "Session 1: Invited Talks",
            "day" : "monday"
        },

        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Demand-Aware Networks: Metrics, Models, Algorithms (25min)",
            "abstract" : "Emerging optical communication topologies enable demand-aware networks: networks whose physical topology is optimized towards the demand, either statically or dynamically. But how useful are demand-aware networks? As usual in computer science, the answer is: it depends! In this talk, we explore metrics for quantifying the temporal and non-temporal structure of traffic patterns, and show analytically how these metrics relate to 'what can be achieved' by a demand-aware network. In particular, we propose an information-theoretic approach and highlight an intriguing connection between demand-aware networks and coding and self-adjusting data structures. We discuss both offline and online algorithms to design demand-aware networks, and as a case study, show how to design demand-aware networks whose route lengths are proportional to the entropy of the traffic pattern; this is asymptotically optimal. ",
            "authors" : "Chen Avin <em>(BGU)</em> &amp; Stefan Schmid <em>(University of Vienna)</em>"
        },
 
        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Frequency Stabilized Coherent WDM Optical Links for Low-Energy Data Center Interconnects (25min)",
            "authors" : "Dan Blumenthal <em>(UCSB)</em> ",
            "abstract" : "As data center ethernet switches scale towards 100Tbps, scaling DCI fiber links will face significant cost, power and engineering barriers. In this talk we describe the FRESCO approach that uses ultra-stable, ultra-low linewidth laser and silicon photonic transceiver technologies to bring high-capacity coherent WDM links into the DCI without the need for DSPs and other power consuming technologies."
        },
 
        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Supporting optical networks with the Corundum programmable NIC platform (25min)",
            "authors" : "Alex Forencich <em>(UCSD)</em> ",
            "abstract" : "Corundum is an open-source, FPGA-based prototyping platform for network interface development at up to 100 Gbps and beyond. The Corundum platform includes several core features to enable real-time, high-line-rate operations including a high-performance datapath, 10G/25G/100G Ethernet MACs, PCI Express (gen 3), a custom PCIe DMA engine, and native high-precision IEEE 1588 timestamping (PTP). In particular, Corundum is designed to support the implementation of a microsecond-precision time-division multiple access (TDMA) hardware scheduler to enforce a TDMA schedule at 100 Gbps line rate with no CPU overhead. In this talk, I'll describe how Corundum can support optical circuit-switched network architectures employing a range of physical-layer technologies, and how applications layered on these circuit-switched networks can be supported through a combination of endhost and NIC functionality."
        },
 
        {
            "paper" : "true",
            "day" : "monday",
            "title" : "Invited Talk: Optics to scale the Datacenter: Technology directions over the next decade (25min)",
            "authors" : "Ryohei Urata (Google)",
            "abstract" : "We will review the role of optics in bringing hyperscale datacenters to their present state. We will then discuss future technology directions, with focus on themes of higher speeds, integration, and the end of Moore’s Law."
        },

        {
            "break" : "true",
            "time" : "3.55 - 4.00 pm EDT",
            "break_type" : "(Virtual) Coffee Break",
            "day" : "monday"
        },

        {
            "keynote" : "true",
            "time" : "4:00 - 4:30 pm EDT",
            "keynote_title" : "Industrial panel session + Closing remarks",
            "keynote_speaker" : "Mark Filer <em>(Microsoft)</em>, Giannis Patronas <em>(Nvidia Networking, Mellanox Advanced Technologies)</em>, Ryohei Urata <em>(Google)</em>, Ying Zhang <em>(Facebook)</em><br/><b>Moderator:</b> Manya Ghobadi <em>(MIT)</em>",
            "day" : "monday"
        },

        {
            "program_end" : "true"
        }
        
    ]
}
